D = {'a' : 1, 'b' : 2, 'c' : 3}
print(D)

D['e'] = 99                         #присвоєння новому ключу значення, що відповідно збільшує розмір словника
print(D)

#print(D['f'])                      #посилання на неіснуючий ключ призведе до помилки

print('f' in D)                     #запитуємо чи є у словнику D ключ 'f'

if not 'f' in D:                    #дослівно: якщо немає ключа 'f' у словнику D, то
    print('missing')                #виводимо на екран строку 'missing'
    print('no, really...')          #оператор if буде виконуватися доти, поки є одинакові відступи